raxwinrm/winrm_commands/execute_command.xml

 <s:Envelope
   xmlns:s="http://www.w3.org/2003/05/soap-envelope"
   xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
   xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">
   <s:Header>
     <wsa:To>
       {{ uri }}
     </wsa:To>
     <wsman:ResourceURI s:mustUnderstand="true">
       http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd
     </wsman:ResourceURI>
     <wsa:ReplyTo>
       <wsa:Address s:mustUnderstand="true">
         http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
       </wsa:Address>
     </wsa:ReplyTo>
     <wsa:Action s:mustUnderstand="true">
       http://schemas.microsoft.com/wbem/wsman/1/windows/shell/Command
     </wsa:Action>
     <wsman:MaxEnvelopeSize s:mustUnderstand="true">153600</wsman:MaxEnvelopeSize>
     <wsa:MessageID>
       uuid:{{ message_id }}</wsa:MessageID>
     <wsman:Locale xml:lang="en-US" s:mustUnderstand="false" />
     <wsman:SelectorSet>
         <wsman:Selector Name="ShellId">
           {{ shell_id }}
         </wsman:Selector>
     </wsman:SelectorSet>
     <wsman:OptionSet xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         <wsman:Option Name="WINRS_CONSOLEMODE_STDIN">TRUE</wsman:Option>
         <wsman:Option Name="WINRS_SKIP_CMD_SHELL">FALSE</wsman:Option>
     </wsman:OptionSet>
     <wsman:OperationTimeout>PT{{ timeout }}.000S</wsman:OperationTimeout>
   </s:Header>
   <s:Body>
     <rsp:CommandLine
       xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell">
       <rsp:Command>{{ command }}</rsp:Command>
        {%- if command_args is defined and command_args %}
            {%- for arg in command_args %}
                <rsp:Arguments>{{ arg }}</rsp:Arguments>
            {%- endfor %}
         {%- endif %}
     </rsp:CommandLine>
   </s:Body>
 </s:Envelope>